thejar/app/views/users/show.html.erb

		<h3>Challenges</h3>
			<% if @user.challenges.length > 0 %>
---
SELECT "challenges".* FROM "challenges" INNER JOIN "user_challenges" ON "challenges"."id" = "user_challenges"."challenge_id" WHERE "user_challenges"."user_id" = $1  [["user_id", 7]]