thejar/app/controllers/challenges_controller.rb

  def show
    user_id = params[:user_id]
    c_id = params[:id]
    @user = User.find_by_id(params[:user_id])
    @current_user = current_user
    @is_challenge_owner = @user.id == @current_user.id
    @challenge = User.find_by_id(user_id).challenges.find_by_id(c_id)
    # dates
    @is_past = is_past
    @duration = get_duration(@challenge.start_date, @challenge.end_date)
    @messages = @challenge.messages.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
SELECT  "challenges".* FROM "challenges" INNER JOIN "user_challenges" ON "challenges"."id" = "user_challenges"."challenge_id" WHERE "user_challenges"."user_id" = $1 AND "challenges"."id" = 3 LIMIT 1  [["user_id", 2]]
SELECT "messages".* FROM "messages"  WHERE "messages"."challenge_id" = $1  [["challenge_id", 3]]

  def new

    @current_user = current_user
    @challenge= Challenge.new
    @user =User.find_by_id(params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 10 LIMIT 1

  def create
    new_challenge =params.require(:challenge).permit(:title,:charity_id,:start_date,:end_date,:status,:challenge_amount)
    phone_numbers = params[:phone_numbers].split(' ')
    # binding.pry
    @challenge=Challenge.create(new_challenge)
---
INSERT INTO "user_challenges" ("challenge_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["challenge_id", 7], ["created_at", "2014-09-04 21:00:02.418222"], ["updated_at", "2014-09-04 21:00:02.418222"], ["user_id", 7]]