thejar/app/controllers/messages_controller.rb

  def create
    new_message = params.require(:message).permit(:text, :is_private, :is_caught, :is_confirmed, :is_invitation)
    challenge_id = params[:challenge_id]
    # @user = current_user
    @user = User.find_by_id(1)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 7 LIMIT 1