thejar/app/controllers/messages_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 0 LIMIT 1
SELECT "messages".* FROM "messages"  WHERE "messages"."challenge_id" = $1  ORDER BY created_at DESC  [["challenge_id", 6]]
SELECT  "challenges".* FROM "challenges" INNER JOIN "user_challenges" ON "challenges"."id" = "user_challenges"."challenge_id" WHERE "user_challenges"."user_id" = $1 AND "challenges"."id" = 6 LIMIT 1  [["user_id", 2]]
---
  def index
    @user = User.find_by_id(params[:user_id])
    @messages = @user.challenges.find_by_id(params[:challenge_id]).messages.all.order('created_at DESC')
    @user_messages = []
    @messages.each do |message|

INSERT INTO "messages" ("challenge_id", "created_at", "is_caught", "is_invitation", "is_private", "text", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    new_message = params.require(:message).permit(:text, :is_private, :is_caught, :is_confirmed, :is_invitation, :img_url, :challenge_id)
    @user = current_user
    @message = @user.messages.create(new_message)