thejar/app/controllers/passwords_controller.rb

	def edit
		@user = User.find_by_code(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."code" = 'ttF6PwAXa9v_OaymspMbxg' LIMIT 1

	def update
		@user = User.find(params[:id])

		if @user
			update_password = params.require(:user).permit(:password, :password_confirmation)
			@user.update_attributes(update_password)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 7  [["password_digest", "$2a$10$2vuo5n2lQ8tr3.eUSodRfu9jRhMutlD6Zwv0e83O2kJCGoZvrc1JO"], ["updated_at", "2014-09-04 01:21:55.095863"]]