thejar/app/controllers/passwords_controller.rb

	def update
		@user = User.find_by_code(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."code" = 'WINWc6Xna7RuvZgtyP-hsw' LIMIT 1