thejar/app/controllers/sessions_controller.rb

  def create
  	@user=User.authenticate(params[:user][:email], params[:user][:password])
    challenge_id = params[:challenge]

  	if @user
  		session[:user_id]= @user.id
      if challenge_id != nil || challenge_id == ''
        challenge = Challenge.find_by_id(challenge_id)
        user = User.find_by_id(@user.id)
        user.challenges << challenge
        user_challenge = UserChallenge.where(challenge_id: challenge_id, user_id: user.id)
---
SELECT  "challenges".* FROM "challenges"  WHERE "challenges"."id" = 3 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 7 LIMIT 1
INSERT INTO "user_challenges" ("challenge_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["challenge_id", 3], ["created_at", "2014-09-05 01:39:08.991125"], ["updated_at", "2014-09-05 01:39:08.991125"], ["user_id", 7]]
SELECT "user_challenges".* FROM "user_challenges"  WHERE "user_challenges"."challenge_id" = 3 AND "user_challenges"."user_id" = 7