thejar/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "phone_number", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "challenges".* FROM "challenges"  WHERE "challenges"."id" = 3 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'milh@milhouse.com' LIMIT 1
INSERT INTO "user_challenges" ("challenge_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["challenge_id", 3], ["created_at", "2014-09-04 04:05:32.204777"], ["updated_at", "2014-09-04 04:05:32.204777"], ["user_id", 17]]
SELECT "challenges".* FROM "challenges" INNER JOIN "user_challenges" ON "challenges"."id" = "user_challenges"."challenge_id" WHERE "user_challenges"."user_id" = $1  [["user_id", 17]]
---
  def create

    new_user = params[:user].permit(:email, :avatar, :password, :password_confirmation, :first_name, :last_name, :phone_number)

    challenge_id = params[:challenge]
    check_if_new_user = User.new(new_user)

      if check_if_new_user.save!

        if challenge_id != nil || challenge_id != ''
          challenge = Challenge.find_by_id(challenge_id)
          user = User.find_by_email(new_user[:email])
          user.challenges << challenge
          user_challenge = UserChallenge.where(challenge_id: challenge.id, user_id: user.id)

UPDATE "users" SET "email" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = 1  [["email", "too@nasty.com"], ["first_name", "Too"], ["last_name", "Nasty"], ["updated_at", "2014-09-04 21:50:54.129079"]]
---
  def update
    find_user_id
    @current_user = current_user
    updated_params = params.require(:user).permit(:email, :first_name, :last_name, :avatar)
    @user.update_attributes(updated_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]
---
    def find_user_id
      user_id = params[:id]
      @user = User.find(user_id)