thejar/app/views/challenges/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_challenges" ON "users"."id" = "user_challenges"."user_id" WHERE "user_challenges"."challenge_id" = $1  [["challenge_id", 3]]
---
      <ul>
        <% @challenge.users.each do |user| %>